app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "twitter" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["twitter", "stefomn"], ["updated_at", "2022-06-17 21:40:50.273056"], ["id", 9]]